:PROPERTIES:
:ID:       BF95BUICK3-47D3-412E-92E7-CFC2B1081DE2
:END:
#+title: 2022-04-29
#+HUGO_SECTION:daily
#+filetags: :draft:
#+filetags: :draft:

** dedicated-session-dumping
:LOGBOOK:
CLOCK: [2022-05-03 Tue 14:45]--[2022-05-03 Tue 17:45] =>  3:00
CLOCK: [2022-05-02 Mon 14:41]--[2022-05-02 Mon 17:10] =>  2:29
:END:
1. 紀錄dumping開始時間
2. 進入dumping的介面
   可以是一個新的buffer,把自己變成dumping-buffer
3. 顯示dumping的insturction
   可以有default,或者在配置文件裏顯示
   可以給一些dumping的選項
4. 結束dumping
   給一個log紀錄做了什麼(像magit的commit)
   在使用C-c C-c後結束dumping
5. 把dumping的紀錄寫入設置好的dedicated-session-journal(或者使用dedicated-session-log進行紀錄)
** Writing functions! [4/5]
:LOGBOOK:
CLOCK: [2022-04-30 Sat 17:15]--[2022-04-30 Sat 17:20] =>  0:05
:END:
*** DONE ~dedicated-session~
CLOSED: [2022-05-03 Tue 17:47]
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-05-03 Tue 17:47]
CLOCK: [2022-04-30 Sat 15:47]--[2022-04-30 Sat 17:08] =>  1:21
- Note taken on [2022-04-30 Sat 17:08] \\
  finished the speicifications
CLOCK: [2022-04-30 Sat 13:53]--[2022-04-30 Sat 15:08] =>  1:15
CLOCK: [2022-04-30 Sat 13:13]--[2022-04-30 Sat 13:53] =>  0:40
CLOCK: [2022-04-30 Sat 20:28]--[2022-04-30 Sat 23:34] =>  3:06
CLOCK: [2022-04-30 Sat 17:20]--[2022-04-30 Sat 17:59] =>  0:39
:END:
entry point of the facility. it will:
1. start a session(set ~dedicated-session-in~ to ~t~)
2. call ~dedicated-session-dumping~
   after dumping finished, enter next phase like magit commit
3. call ~dedicated-session-doing~
*** TODO ~dedicated-session-doing~ [2/3]
:LOGBOOK:
CLOCK: [2022-05-03 Tue 17:49]--[2022-05-03 Tue 18:04] =>  0:15
:END:
1. set ~dedicated-session-in~ to ~'doing~
2. create entry of doing
3. call ~dedicated-session-bar-rest-toggle~
**** DONE ~dedicated-session-doing-bar-rest-toggle &optional done?~
CLOSED: [2022-05-03 Tue 18:30]
:LOGBOOK:
CLOCK: [2022-05-03 Tue 18:33]--[2022-05-03 Tue 18:35] =>  0:02
- State "DONE"       from "TODO"       [2022-05-03 Tue 18:30]
CLOCK: [2022-05-03 Tue 18:04]--[2022-05-03 Tue 18:30] =>  0:26
:END:
1. will toggle the ~dedicated-session-doing-state~ to bar/rest,
2. find the last bar/rest. if there's none, create one
3. call ~dedicated-session-record-time~,
4. if ~done?~ is ture, meaning it's called by ~dedicated-session-releasing~, that the doing stage is done, so no new insert. and return.
5. otherwise,
   1. create new rest/bar entry,
   2. call ~dedicated-session-record-time~,
   3. if it's a bar, message "bar no.X starting"
   4. if it's a rest, call ~dedicated-session-doing--rest-prompt~
   5. return
**** TODO ~dedicated-session-doing-rest-prompt~
:LOGBOOK:
CLOCK: [2022-05-03 Tue 20:56]--[2022-05-03 Tue 21:44] =>  0:48
:END:
1. start a new org buffer
2. insert content from ~dedicated-session-rest-collect~
3. popup a window, and give it the buffer
4. wait for user input to call ~dedicated-session-doing-bar-rest-toggle~ and return
**** DONE ~dedicated-session-rest-collect~
CLOSED: [2022-05-03 Tue 21:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-05-03 Tue 21:46]
CLOCK: [2022-05-03 Tue 21:46]--[2022-05-03 Tue 21:46] =>  0:00
:END:
1. go to the source file
2. filter rest methods with the ~dedicated-session-state~ as tags
3. return the filtered rest methods 
*** DONE ~dedicated-session-releasing~
CLOSED: [2022-05-04 Wed 16:13]
:LOGBOOK:
CLOCK: [2022-05-04 Wed 15:45]--[2022-05-04 Wed 16:13] =>  0:28
- State "DONE"       from "TODO"       [2022-05-04 Wed 16:13]
:END:
manualy called.
1. call ~dedicated-session-bar-rest-toggle t~, to end the last bar/rest
2. call ~dedicated-session-end~
*** DONE ~dedicated-session-log~
CLOSED: [2022-05-04 Wed 15:46]
:LOGBOOK:
- State "DONE"       from "TODO"       [2022-05-04 Wed 15:46]
CLOCK: [2022-05-04 Wed 14:37]--[2022-05-04 Wed 15:46] =>  1:09
:END:
this function log notes in the corresponding entry in the journal file
1. display a capture buffer
2. after recieving C-c C-c, goto journal file buffer, create an entry under the ~logs~ (if it's not present, create one) with heading at (current time - start - time), and insert the note under that entry.
